Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateGutter Property
 Could not create Gutter. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateGutter { get; }
Public Shared ReadOnly Property CannotCreateGutter As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateGutter {
	FailureDefinitionId^ get ();
}
static member CannotCreateGutter : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace